package com.oujinjin.www.view;

import java.util.Scanner;

public class View {
    public int rl() {
        msg("===============================================");
        msg("====【1】用户注册==============================");
        msg("====【2】用户登陆==============================");
        msg("===============================================");
        msg("请输入操作指令：");
        return new Scanner(System.in).nextInt();
    }

    public int register(){
        msg("===============================================");
        msg("====(1)管理员注册================================");
        msg("====(2)用户注册==================================");
        msg("===============================================");
        msg("请输入操作指令：");
        return new Scanner(System.in).nextInt();
    }

    public int login(){
        msg("===============================================");
        msg("====(1)管理员登陆================================");
        msg("====(2)用户登陆==================================");
        msg("===============================================");
        msg("请输入操作指令：");
        return new Scanner(System.in).nextInt();
    }

    private void msg(Object obj) {
        System.out.println(obj);
    }

    public View() {
    }

}
